{
    "gravity": "Gravity is the fundamental force that attracts two bodies towards each other. It depends on their masses and the distance between them. On Earth, it gives weight to physical objects and causes objects to fall towards the ground.",
    "quantum mechanics": "Quantum mechanics is a fundamental theory in physics that describes nature at the smallest scales, such as that of particles like electrons and photons. It introduces concepts like wave-particle duality, quantization of energy, and the uncertainty principle.",
    "chemical bonding": "Chemical bonding is the process by which atoms join together to form molecules. The primary types of chemical bonds are ionic bonds, where electrons are transferred between atoms; covalent bonds, where electrons are shared; and metallic bonds, where electrons are delocalized across a lattice of metal ions.",
    "thermodynamics": "Thermodynamics is the branch of physical science that studies the relationships between heat, work, and energy. It is governed by several laws, including the conservation of energy (first law) and the increase of entropy (second law), which describe how energy is transferred and transformed.",
    "cell theory": "Cell theory is a fundamental concept in biology that states all living organisms are made up of one or more cells, the cell is the basic unit of life, and all cells arise from pre-existing cells. This theory forms the foundation of modern biology and helps us understand the structure and function of living organisms.",
    "genetics": "Genetics is the study of genes, heredity, and variation in living organisms. It explores how traits and characteristics are passed from one generation to the next through genes, which are segments of DNA. It includes the study of gene expression, genetic variation, and inheritance patterns.",
    "calculus": "Calculus is a branch of mathematics that focuses on limits, derivatives, integrals, and infinite series. It is used to study changes and motion, providing tools for understanding how quantities change and accumulate. Calculus is fundamental in fields like physics, engineering, and economics.",
    "algebra": "Algebra is a branch of mathematics that deals with symbols and the rules for manipulating these symbols. It includes solving equations, understanding functions, and working with polynomials. Algebra provides a framework for modeling and solving real-world problems using mathematical expressions.",
    "electromagnetic waves": "Electromagnetic waves are waves that propagate through space by oscillating electric and magnetic fields. They include a wide range of wavelengths and frequencies, such as radio waves, microwaves, infrared, visible light, ultraviolet, X-rays, and gamma rays. They are essential for many technologies, including communication and imaging.",
    "thermochemistry": "Thermochemistry is a branch of chemistry that examines the heat energy involved in chemical reactions and physical changes. It helps us understand the energy changes associated with reactions, phase transitions, and the formation and breaking of chemical bonds.",
    "photosynthesis": "Photosynthesis is the biochemical process by which green plants, algae, and some bacteria convert light energy into chemical energy stored in glucose. This process uses carbon dioxide and water, producing oxygen as a byproduct. Photosynthesis is crucial for life on Earth as it forms the base of most food chains and contributes to the oxygen content of the atmosphere.",
    "ecosystem dynamics": "Ecosystem dynamics is the study of the interactions between organisms and their environment within an ecosystem. It includes understanding energy flow, nutrient cycling, and the relationships between different species, such as predator-prey interactions and symbiotic relationships. Ecosystem dynamics helps us manage and conserve natural environments.",
    "trigonometry": "Trigonometry is a branch of mathematics that studies the relationships between the angles and sides of triangles. It involves functions such as sine, cosine, and tangent, which are used to solve problems related to angles, distances, and periodic phenomena. Trigonometry is widely used in physics, engineering, and architecture.",
    "vector algebra": "Vector algebra deals with vectors, which are quantities having both magnitude and direction. It includes operations such as addition, subtraction, dot product, and cross product. Vector algebra is essential for solving problems in physics and engineering that involve directional quantities and forces."
}
